# **Pandas 04 - Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data**

### Import Modules

In [10]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.0
1.24.2

### Persiapan Data Frame

In [11]:
# Menentukan jumlah baris dan kolom serta label kolom untuk data frame
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

# Membuat data frame dengan nilai acak antara 1 dan 20, dengan kolom 'bil_pecahan' diubah menjadi tipe data float
df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

# Mengatur indeks data frame menggunakan rentang waktu per jam mulai dari '2023-10-01'
df.index = pd.date_range(start='2023-10-01', periods=n_rows, freq='h') 

# Mengatur ulang indeks menjadi kolom biasa
df = df.reset_index()

# Menambahkan kolom 'teks' dengan nilai 'A', 'B', 'C', 'D', 'E' ke dalam data frame
df['teks'] = list('ABCDE')

# Menampilkan data frame yang telah dibuat
df

                index  bil_pecahan  bil_bulat teks
0 2023-10-01 00:00:00          2.0          2    A
1 2023-10-01 01:00:00          9.0          1    B
2 2023-10-01 02:00:00         19.0          6    C
3 2023-10-01 03:00:00          1.0         14    D
4 2023-10-01 04:00:00         11.0          2    E

In [12]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

### Memilih kolom bertipe data numerik

In [13]:
# Memilih kolom-kolom dalam data frame yang memiliki tipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          2.0          2
1          9.0          1
2         19.0          6
3          1.0         14
4         11.0          2

In [14]:
# Memilih kolom-kolom dalam data frame yang memiliki tipe data float
df.select_dtypes(include='float')

   bil_pecahan
0          2.0
1          9.0
2         19.0
3          1.0
4         11.0

In [15]:
# Memilih kolom-kolom dalam data frame yang memiliki tipe data integer
df.select_dtypes(include='int')

   bil_bulat
0          2
1          1
2          6
3         14
4          2

# Memilih kolom bertipe data string atau **object**

In [16]:
# Memilih kolom-kolom dalam data frame yang memiliki tipe data objek (biasanya string atau data non-numeric)
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

# Memilih kolom bertipe data string atau **datetime**

In [17]:
# Memilih kolom-kolom dalam data frame yang memiliki tipe data datetime
df.select_dtypes(include='datetime')

                index
0 2023-10-01 00:00:00
1 2023-10-01 01:00:00
2 2023-10-01 02:00:00
3 2023-10-01 03:00:00
4 2023-10-01 04:00:00

# Memilih kolom dengan kombinasi tipe data

In [18]:
# Memilih kolom-kolom dalam data frame yang memiliki tipe data numerik atau objek (non-numeric)
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0          2.0          2    A
1          9.0          1    B
2         19.0          6    C
3          1.0         14    D
4         11.0          2    E